{
  "lidar": 
  {"description": "Using some previous and applicable work from members of the ARSENL lab at University of Colorado, Boulder, I created a MATLAB simulation to model the expected polarized returns of a LiDAR system scattering off of different surfaces." },
  "ski":
  {"description": "For my undergraduate senior project, I selected to work on a project that US Nordic presented, requesting the development of a ski jump simulator. There were not many specific project requirements, simply a lack of reliable training methods, and the desire for a solution. We analyzed the forces ski jumpers experience whilst executing the jump and learned that the vast majority are in the body z-direction. This outcome allowed us to create a vertically moving platform to simulate the relative accelerations from the top of the ramp to landing. The main mechanical component was a platform that moved vertically by pneumatic actuators. We also provided visual cues via a VR headset to further simulate the real ski jump experience. As software lead, my main roles were to build a GUI to integrate the mechanical and visual cues and to contrive connection methods between components for a seamless user experience." },
  "aboutme":
  {"description": "Hi! I'm Maya! I'm an Aerospace Engineer with a BS and MS from CU Boulder. Since completing graduate school in 2024, I've been working at Wildfire Defense Systems as a computer scientist, focusing on projects ranging from wildfire risk modeling to Azure cloud-based devOps. I moved from New Jersey to Colorado in 2018 for school and am still in Denver now. Professionally, I’m trained as an aerospace engineer, but I excel in software-based roles and am passionate about making a positive impact through my work. Personally, I enjoy snowboarding, travelling, music, playing sports, and solving puzzles." },
  "spotify":
  {"description": "After getting my Spotify wrapped data in December of 2022, I had a nagging feeling that Spotify reported it incorrectly. I decided to do what any good engineer does when a sanity check feels off - check it myself. I looked into API options, but learned that while Spotify does have one, it does not provide the necessary data to provide the same output as their wrapped has. The only solution was to request data from them, and write a code to parse it to get the information I wanted. As it turned out, I was correct and the data they gave me was not fully accurate. It was less wrong than I thought though, with the biggest difference being that they excluded LoFi fruits music from my top 5 artists despite it being there. Maybe their algorithm just includes safeguards for making their listeners seem less nerdy… "}
}
